# import random
# print("Угадайте загаданное программой число от 1 до 100. Если игра вам надоест, нажмите 0 для выхода")
# i = random.randrange(1, 101)
# t = -1
# ch = 0
#
# while t != i:
#     ch += 1
#     t = int(input("Введите число: "))
#     if t > i:
#         print("Загаданное число меньше")
#     elif t < i and t != 0:
#         print("Загаданное число больше")
#     elif t == 0:
#         print("Игра закончена")
#         break
#     else:
#         if ch % 10 == 1 and ch != 11:
#             print("Вы угадали загаданное число с", ch, "попытки")
#         else:
#             print("Вы угадали загаданное число с", ch, "попыток")

s = 4
